
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Реализация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Дата,
	|	Реализация.Номер,
	|	Реализация.Покупатель,
	|	Реализация.Склад,
	|	Реализация.СуммаДокумента,
	|	Реализация.СписокТоваров.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокТоваровШапка = Макет.ПолучитьОбласть("СписокТоваровШапка");
	ОбластьСписокТоваров = Макет.ПолучитьОбласть("СписокТоваров");
	ОбластьСписокТоваровИтого = Макет.ПолучитьОбласть("СписокТоваровИтого");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокТоваровШапка);
		ВыборкаСписокТоваров = Выборка.СписокТоваров.Выбрать();
		Пока ВыборкаСписокТоваров.Следующий() Цикл
			ОбластьСписокТоваров.Параметры.Заполнить(ВыборкаСписокТоваров);
			ТабДок.Вывести(ОбластьСписокТоваров, ВыборкаСписокТоваров.Уровень());
		КонецЦикла;
		ОбластьСписокТоваровИтого.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьСписокТоваровИтого);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
