
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = СписокТоваров.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина; 
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияСписокТоваров.Товар КАК Товар,
		|	СУММА(РеализацияСписокТоваров.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_СписокТоваров
		|ИЗ
		|	Документ.Реализация.СписокТоваров КАК РеализацияСписокТоваров
		|ГДЕ
		|	РеализацияСписокТоваров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияСписокТоваров.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокТоваров.Товар КАК Товар,
		|	ВТ_СписокТоваров.Количество КАК Количество
		|ИЗ
		|	ВТ_СписокТоваров КАК ВТ_СписокТоваров";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиТоваров.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;
	
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиТоваров.Записать();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар.Представление КАК ТоварПредставление,
		|	ОстаткиТоваровОстатки.Склад КАК Склад,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&Граница,
		|			Склад = &Склад
		|				И Товар В
		|					(ВЫБРАТЬ
		|						ВТ_СписокТоваров.Товар
		|					ИЗ
		|						ВТ_СписокТоваров)) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Сообщение = Новый СообщениеПользователю;
		
		Пока Выборка.Следующий() Цикл
			Сообщение.Текст = СтрШаблон("Не хватает товара %1 в количестве %2 шт. на складе %3.", 
										Выборка.ТоварПредставление, -Выборка.КоличествоОстаток, Выборка.Склад);
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
